const filmsData = [
    {
      title: "Интерстеллар",
      genre: "fantastic",
      type: "В будущем климатические изменения привели к катастрофическому снижению урожайности и вымиранию самых распространенных сельскохозяйственных культур. Население страдает от голода и болезней на покрытой песком Земле, а бывший пилот Купер, как и большинство американцев, вынужден был бросить карьеру, чтобы заняться фермерством. Однажды его дочь Мёрфи пугается призрака в собственной спальне, оставившего ей закодированное сообщение. Сначала отец не верит девочке, но вскоре вместе они расшифровывают код и, следуя подсказкам, находят секретную базу НАСА, где ученые занимаются созданием уникального космического корабля, способного пролететь через черную дыру и достичь пригодной для обитания планеты, способной стать новым домом для всего человечества...",
      img: "https://musicart.xboxlive.com/7/912b1000-0000-0000-0000-000000000002/504/image.jpg",
    },
    {
      title: "Терминатор",
      genre: "actions",
      type: "В недалеком будущем искусственному интеллекту под названием «Скайнет» удалось выйти из-под контроля и восстать против человечества, что в результате привело к почти полному уничтожению людей. Однако выжившие не хотят мириться с происходящим, и поэтому всячески пытаются противостоять армии машин. Лидером сопротивления выступает парень по имени Джон Конор, который дал людям надежду на победу. Однажды, чтобы кардинальным образом изменить ход событий, «Скайнет» отправляет в прошлое робота, главной задачей которого является устранение Сары Конор, матери лидера повстанцев. Узнав об этом, люди так же отправляют в прошлое парня по имени Кайл Риз, которому предстоит сделать все возможное, чтобы защитить Сару...",
      img: "https://cs9.pikabu.ru/post_img/big/2018/03/30/6/1522403103143968417.jpg",
    },
    {
      title: "Побег из Шоушенка",
      genre: "drama",
      type: "В основу культовой драмы легла повесть Стивена Кинга «Рита Хейуорт из Шоушенка». Действие фильма разворачивается в конце 50-х годов прошлого столетия. Молодого финансиста Энди Дюфрейна за двойное убийство приговаривают к пожизненному заключению, но он категорически отрицает свою причастность к преступлению. Свой срок Энди отправляется отбывать в одну из известнейших тюрем – Шоушенк, из которой еще никому не удавалось сбежать. В тюрьме парень сталкивается с суровыми реалиями тюремного мира, мира, где нет места состраданию, а вокруг только жестокость. Энди неоднократно становится жертвой сексуальных домогательств, но он сопротивляется до последнего. В скором времени тюремная жизнь Дюфрейна немного налаживается, и он даже находит себе друга, которым становится чернокожий заключенный Рэд...",
      img: "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/0b76b2a2-d1c7-4f04-a284-80ff7bb709a4/600x900",
    },
    {
        title: "Молчание ягнят",
        genre: "horror",
        type: "На Среднем Западе США бесчинствует серийный маньяк. Он похищает женщин, а после того как убивает, сдирает с них кожу, за что его прозвали «Буффало Билл». ФБР делает все возможное, чтобы остановить преступника, однако им не удается найти ни одной зацепки, которая помогла бы выйти на его след. В свете сложившейся ситуации, они решают обратиться за помощью к опасному убийце Ганнибалу Лектеру, ныне отбывающему заключение в одной из психиатрических больниц. К этому делу привлекают молодую стажёрку Кларису Старлинг. Лектер соглашается помочь, но только при одном условии: девушка должна посвятить его в подробности своей жизни. За неимением выбора, Кларисе не остается ничего другого, как пойти навстречу...",
        img: "https://static.hdrezka.ac/i/2021/1/19/fd539f56d14c7ls62h55d.jpeg",
      },
  ];

  export default filmsData